<?php

class EMPS_RUNumerals {
	public function inflection($value){
		$h=floor(($value%100)/10);
		$d=$value%10;
		
		if($d==1){
			if($h==1){
				return 5;
			}else{
				return 1;
			}
		}
		if($d>=2 && $d<=4){
			if($h==1){
				return 5;
			}else{
				return 2;
			}
		}
		
		return 5;
	}


	/////////////////////////////////////////////////////////////////////////////////
	// сумма прописью string str_digit_str(integer)
	public function str_digit_str($summ){
		$tmp_num = (integer)$summ;  // текущий
		$str = "";
		$i = 1;            // счетчик триад
		$th = array("");
	
		// откусываем по три цифры с конца и обрабатываем функцией
		while(mb_strlen($tmp_num) > 0)
		{
			$tri = "";
			if (mb_strlen($tmp_num) > 3)
			{
				$dig = mb_substr($tmp_num,mb_strlen($tmp_num)-3);
				$tmp_num = mb_substr($tmp_num,0, -3);
			}
			else
			{
				$dig = $tmp_num;
				$tmp_num = "";
			}
		   if ($i == 1) $th = " ";
		   else if ($i == 2) $th = " тысяч ";
		   else if ($i == 3) $th = " миллионов ";
		   else if ($i == 4) $th = " миллиардов ";
		   else if ($i == 5) $th = " биллионов ";
		   else if ($i == 6) $th = " триллионов ";
		   
			// вызываем функцию "сумма прописью" для нашей триады и присоединяем название разряда
			$str = $dig == 0 ? '' : $this->digit_to_string($dig).$th.$str;
			$i++;
		}
		
		// а теперь заменим неправильные падежи - их не так много, поэтому обойдемся массивом замен
		$tr_arr = array(
			"один тысяч" => "одна тысяча",
			"два тысяч" => "две тысячи",
			"три тысяч" => "три тысячи",
			"четыре тысяч" => "четыре тысячи",
			"один миллионов" => "один миллион",
			"два миллионов" => "два миллиона",
			"три миллионов" => "три миллиона",
			"четыре миллионов" => "четыре миллиона",
			"один миллиардов" => "один миллиард",
			"два миллиардов" => "два миллиарда",
			"три миллиардов" => "три миллиарда",
			"четыре миллиардов" => "четыре миллиарда", );
	
		// заменяем падежи
		$str = strtr($str, $tr_arr);
		
		$first = mb_substr($str,0,1,"utf-8");
		$first = mb_strtoupper($first,"utf-8");
		$str = $first.mb_substr($str,1,mb_strlen($str),"utf-8");
		
		return($str);
	}
	
	// сумма прописью до 999
	function digit_to_string($dig){
		$str = "";
		
		// определяем массивы единиц, десятков и сотен
		$ed = array("","один","два","три","четыре","пять","шесть","семь","восемь","девять","десять",
			"одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать",
			"семнадцать","восемнадцать","девятнадцать","двадцать");
		$des = array("","десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто");
		$sot = array("","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот");
	
		$dig = (int)$dig;
		if ($dig > 0 && $dig <= 20)
		{
			$str = $ed[$dig];
		}
		else if ($dig > 20 && $dig < 100)
		{
			$tmp1 = mb_substr($dig,0,1);
			$tmp2 = mb_substr($dig,1,1);
			$str = $des[$tmp1]." ".$ed[$tmp2];
		}
		else if ($dig > 99 && $dig < 1000)
	   {
			$tmp1 = mb_substr($dig,0,1);
			if (mb_substr($dig,1,2) > 20)
			{
				$tmp2 = mb_substr($dig,1,1);
				$tmp3 = mb_substr($dig,2,1);
				$str = $sot[$tmp1]." ".$des[$tmp2]." ".$ed[$tmp3];
			}
			else $str = $sot[$tmp1]." ".$this->digit_to_string(mb_substr($dig,1,2));
		}
	  return $str;
	}

}

?>